# AtomTouchedNotAllowedDelete Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AtomTouchedNotAllowedDelete Property
BuiltInFailures..::..GroupFailures Class See Also
---
Changes to groups are only allowed during Edit Group mode. Use Edit Group to make this change.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AtomTouchedNotAllowedDelete { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AtomTouchedNotAllowedDelete As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AtomTouchedNotAllowedDelete {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace